#### [`repos`] Terraform Plan 📖`success`

<a href="https://app.terraform.io/app/cdktf-team/prebuilt-providers/runs/run-C2D3TfaxZ9KjRpwP" target="_blank">Remote Plan Link ↗️</a>

<details><summary>Show Plan</summary>

```tf
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cdktf-team/prebuilt-providers/runs/run-C2D3TfaxZ9KjRpwP

Waiting for the plan to start...

Terraform v1.6.5
on linux_amd64
Initializing plugins and modules...
data.github_team.cdktf-team-cdktf: Reading...
data.github_team.cdktf-team-cdktf: Read complete after 6s [id=6602018]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_issue_label.repos_cdktfprovideracme_repositorysetup_noautocloselabel_A42E66E9 will be created
  + resource "github_issue_label" "repos_cdktfprovideracme_repositorysetup_noautocloselabel_A42E66E9" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-acme"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfprovideracmego_repositorysetup_noautocloselabel_56EE426A will be created
  + resource "github_issue_label" "repos_cdktfprovideracmego_repositorysetup_noautocloselabel_56EE426A" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-acme-go"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderarchive_repositorysetup_noautocloselabel_9DA974BE will be created
  + resource "github_issue_label" "repos_cdktfproviderarchive_repositorysetup_noautocloselabel_9DA974BE" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-archive"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderarchivego_repositorysetup_noautocloselabel_9A690564 will be created
  + resource "github_issue_label" "repos_cdktfproviderarchivego_repositorysetup_noautocloselabel_9A690564" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-archive-go"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfprovideraws_repositorysetup_noautocloselabel_28320FA8 will be created
  + resource "github_issue_label" "repos_cdktfprovideraws_repositorysetup_noautocloselabel_28320FA8" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-aws"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderawsgo_repositorysetup_noautocloselabel_F6214C00 will be created
  + resource "github_issue_label" "repos_cdktfproviderawsgo_repositorysetup_noautocloselabel_F6214C00" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-aws-go"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderazuread_repositorysetup_noautocloselabel_C003DC33 will be created
  + resource "github_issue_label" "repos_cdktfproviderazuread_repositorysetup_noautocloselabel_C003DC33" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-azuread"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderazureadgo_repositorysetup_noautocloselabel_15FAA5F0 will be created
  + resource "github_issue_label" "repos_cdktfproviderazureadgo_repositorysetup_noautocloselabel_15FAA5F0" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-azuread-go"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderazurerm_repositorysetup_noautocloselabel_839E6595 will be created
  + resource "github_issue_label" "repos_cdktfproviderazurerm_repositorysetup_noautocloselabel_839E6595" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-azurerm"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderazurermgo_repositorysetup_noautocloselabel_3FD95023 will be created
  + resource "github_issue_label" "repos_cdktfproviderazurermgo_repositorysetup_noautocloselabel_3FD95023" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-azurerm-go"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfprovidercloudflare_repositorysetup_noautocloselabel_2EAD0062 will be created
  + resource "github_issue_label" "repos_cdktfprovidercloudflare_repositorysetup_noautocloselabel_2EAD0062" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-cloudflare"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfprovidercloudflarego_repositorysetup_noautocloselabel_8A2334C1 will be created
  + resource "github_issue_label" "repos_cdktfprovidercloudflarego_repositorysetup_noautocloselabel_8A2334C1" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-cloudflare-go"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfprovidercloudinit_repositorysetup_noautocloselabel_594925D8 will be created
  + resource "github_issue_label" "repos_cdktfprovidercloudinit_repositorysetup_noautocloselabel_594925D8" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-cloudinit"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfprovidercloudinitgo_repositorysetup_noautocloselabel_24F4EA21 will be created
  + resource "github_issue_label" "repos_cdktfprovidercloudinitgo_repositorysetup_noautocloselabel_24F4EA21" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-cloudinit-go"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderdatabricks_repositorysetup_noautocloselabel_B95F0945 will be created
  + resource "github_issue_label" "repos_cdktfproviderdatabricks_repositorysetup_noautocloselabel_B95F0945" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-databricks"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderdatabricksgo_repositorysetup_noautocloselabel_4B2B9752 will be created
  + resource "github_issue_label" "repos_cdktfproviderdatabricksgo_repositorysetup_noautocloselabel_4B2B9752" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-databricks-go"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderdatadog_repositorysetup_noautocloselabel_498B72D9 will be created
  + resource "github_issue_label" "repos_cdktfproviderdatadog_repositorysetup_noautocloselabel_498B72D9" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-datadog"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderdatadoggo_repositorysetup_noautocloselabel_C6D50725 will be created
  + resource "github_issue_label" "repos_cdktfproviderdatadoggo_repositorysetup_noautocloselabel_C6D50725" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-datadog-go"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderdigitalocean_repositorysetup_noautocloselabel_26BB0A6E will be created
  + resource "github_issue_label" "repos_cdktfproviderdigitalocean_repositorysetup_noautocloselabel_26BB0A6E" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-digitalocean"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderdigitaloceango_repositorysetup_noautocloselabel_2CABCEA6 will be created
  + resource "github_issue_label" "repos_cdktfproviderdigitaloceango_repositorysetup_noautocloselabel_2CABCEA6" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-digitalocean-go"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderdnsimple_repositorysetup_noautocloselabel_18F6B3F9 will be created
  + resource "github_issue_label" "repos_cdktfproviderdnsimple_repositorysetup_noautocloselabel_18F6B3F9" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-dnsimple"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderdnsimplego_repositorysetup_noautocloselabel_E4BD8BCB will be created
  + resource "github_issue_label" "repos_cdktfproviderdnsimplego_repositorysetup_noautocloselabel_E4BD8BCB" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-dnsimple-go"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderdocker_repositorysetup_noautocloselabel_A87ACA3C will be created
  + resource "github_issue_label" "repos_cdktfproviderdocker_repositorysetup_noautocloselabel_A87ACA3C" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-docker"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderdockergo_repositorysetup_noautocloselabel_59889C04 will be created
  + resource "github_issue_label" "repos_cdktfproviderdockergo_repositorysetup_noautocloselabel_59889C04" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-docker-go"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderexternal_repositorysetup_noautocloselabel_EEEB1DC2 will be created
  + resource "github_issue_label" "repos_cdktfproviderexternal_repositorysetup_noautocloselabel_EEEB1DC2" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-external"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderexternalgo_repositorysetup_noautocloselabel_2C993D19 will be created
  + resource "github_issue_label" "repos_cdktfproviderexternalgo_repositorysetup_noautocloselabel_2C993D19" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-external-go"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfprovidergithub_repositorysetup_noautocloselabel_56CBA80D will be created
  + resource "github_issue_label" "repos_cdktfprovidergithub_repositorysetup_noautocloselabel_56CBA80D" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-github"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfprovidergithubgo_repositorysetup_noautocloselabel_F09019D7 will be created
  + resource "github_issue_label" "repos_cdktfprovidergithubgo_repositorysetup_noautocloselabel_F09019D7" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-github-go"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfprovidergitlab_repositorysetup_noautocloselabel_0A4F77F3 will be created
  + resource "github_issue_label" "repos_cdktfprovidergitlab_repositorysetup_noautocloselabel_0A4F77F3" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-gitlab"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfprovidergitlabgo_repositorysetup_noautocloselabel_92FAB417 will be created
  + resource "github_issue_label" "repos_cdktfprovidergitlabgo_repositorysetup_noautocloselabel_92FAB417" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-gitlab-go"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfprovidergoogle_repositorysetup_noautocloselabel_42426A4D will be created
  + resource "github_issue_label" "repos_cdktfprovidergoogle_repositorysetup_noautocloselabel_42426A4D" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-google"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfprovidergooglebeta_repositorysetup_noautocloselabel_4BA6E735 will be created
  + resource "github_issue_label" "repos_cdktfprovidergooglebeta_repositorysetup_noautocloselabel_4BA6E735" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-googlebeta"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfprovidergooglebetago_repositorysetup_noautocloselabel_D7128779 will be created
  + resource "github_issue_label" "repos_cdktfprovidergooglebetago_repositorysetup_noautocloselabel_D7128779" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-googlebeta-go"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfprovidergooglego_repositorysetup_noautocloselabel_981DFAFA will be created
  + resource "github_issue_label" "repos_cdktfprovidergooglego_repositorysetup_noautocloselabel_981DFAFA" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-google-go"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderhashicups_repositorysetup_noautocloselabel_E2630299 will be created
  + resource "github_issue_label" "repos_cdktfproviderhashicups_repositorysetup_noautocloselabel_E2630299" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-hashicups"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderhashicupsgo_repositorysetup_noautocloselabel_79A02ABE will be created
  + resource "github_issue_label" "repos_cdktfproviderhashicupsgo_repositorysetup_noautocloselabel_79A02ABE" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-hashicups-go"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderhelm_repositorysetup_noautocloselabel_5C25C63C will be created
  + resource "github_issue_label" "repos_cdktfproviderhelm_repositorysetup_noautocloselabel_5C25C63C" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-helm"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderhelmgo_repositorysetup_noautocloselabel_EDBBE1BB will be created
  + resource "github_issue_label" "repos_cdktfproviderhelmgo_repositorysetup_noautocloselabel_EDBBE1BB" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-helm-go"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderionoscloud_repositorysetup_noautocloselabel_88C1CFF1 will be created
  + resource "github_issue_label" "repos_cdktfproviderionoscloud_repositorysetup_noautocloselabel_88C1CFF1" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-ionoscloud"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderionoscloudgo_repositorysetup_noautocloselabel_EC00C532 will be created
  + resource "github_issue_label" "repos_cdktfproviderionoscloudgo_repositorysetup_noautocloselabel_EC00C532" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-ionoscloud-go"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderkubernetes_repositorysetup_noautocloselabel_F8B87C78 will be created
  + resource "github_issue_label" "repos_cdktfproviderkubernetes_repositorysetup_noautocloselabel_F8B87C78" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-kubernetes"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderkubernetesgo_repositorysetup_noautocloselabel_AE769E27 will be created
  + resource "github_issue_label" "repos_cdktfproviderkubernetesgo_repositorysetup_noautocloselabel_AE769E27" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-kubernetes-go"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderlocal_repositorysetup_noautocloselabel_A41B99E2 will be created
  + resource "github_issue_label" "repos_cdktfproviderlocal_repositorysetup_noautocloselabel_A41B99E2" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-local"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderlocalgo_repositorysetup_noautocloselabel_2CB7C13C will be created
  + resource "github_issue_label" "repos_cdktfproviderlocalgo_repositorysetup_noautocloselabel_2CB7C13C" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-local-go"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfprovidernewrelic_repositorysetup_noautocloselabel_0F1A601F will be created
  + resource "github_issue_label" "repos_cdktfprovidernewrelic_repositorysetup_noautocloselabel_0F1A601F" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-newrelic"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfprovidernewrelicgo_repositorysetup_noautocloselabel_03E5E0A6 will be created
  + resource "github_issue_label" "repos_cdktfprovidernewrelicgo_repositorysetup_noautocloselabel_03E5E0A6" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-newrelic-go"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfprovidernull_repositorysetup_noautocloselabel_11DB42C8 will be created
  + resource "github_issue_label" "repos_cdktfprovidernull_repositorysetup_noautocloselabel_11DB42C8" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-null"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfprovidernullgo_repositorysetup_noautocloselabel_36C9260B will be created
  + resource "github_issue_label" "repos_cdktfprovidernullgo_repositorysetup_noautocloselabel_36C9260B" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-null-go"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderokta_repositorysetup_noautocloselabel_97984950 will be created
  + resource "github_issue_label" "repos_cdktfproviderokta_repositorysetup_noautocloselabel_97984950" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-okta"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfprovideroktago_repositorysetup_noautocloselabel_BF08ED90 will be created
  + resource "github_issue_label" "repos_cdktfprovideroktago_repositorysetup_noautocloselabel_BF08ED90" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-okta-go"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfprovideropentelekomcloud_repositorysetup_noautocloselabel_29ECDF9D will be created
  + resource "github_issue_label" "repos_cdktfprovideropentelekomcloud_repositorysetup_noautocloselabel_29ECDF9D" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-opentelekomcloud"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfprovideropentelekomcloudgo_repositorysetup_noautocloselabel_BEE12B51 will be created
  + resource "github_issue_label" "repos_cdktfprovideropentelekomcloudgo_repositorysetup_noautocloselabel_BEE12B51" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-opentelekomcloud-go"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderpagerduty_repositorysetup_noautocloselabel_08C83481 will be created
  + resource "github_issue_label" "repos_cdktfproviderpagerduty_repositorysetup_noautocloselabel_08C83481" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-pagerduty"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderpagerdutygo_repositorysetup_noautocloselabel_81CDF279 will be created
  + resource "github_issue_label" "repos_cdktfproviderpagerdutygo_repositorysetup_noautocloselabel_81CDF279" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-pagerduty-go"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderpostgresql_repositorysetup_noautocloselabel_FA4E6182 will be created
  + resource "github_issue_label" "repos_cdktfproviderpostgresql_repositorysetup_noautocloselabel_FA4E6182" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-postgresql"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderpostgresqlgo_repositorysetup_noautocloselabel_65073780 will be created
  + resource "github_issue_label" "repos_cdktfproviderpostgresqlgo_repositorysetup_noautocloselabel_65073780" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-postgresql-go"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderproject_repositorysetup_noautocloselabel_F39F6D26 will be created
  + resource "github_issue_label" "repos_cdktfproviderproject_repositorysetup_noautocloselabel_F39F6D26" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-project"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderrandom_repositorysetup_noautocloselabel_7594F61F will be created
  + resource "github_issue_label" "repos_cdktfproviderrandom_repositorysetup_noautocloselabel_7594F61F" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-random"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderrandomgo_repositorysetup_noautocloselabel_9332D9F1 will be created
  + resource "github_issue_label" "repos_cdktfproviderrandomgo_repositorysetup_noautocloselabel_9332D9F1" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-random-go"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfprovidersnowflake_repositorysetup_noautocloselabel_8C8301AD will be created
  + resource "github_issue_label" "repos_cdktfprovidersnowflake_repositorysetup_noautocloselabel_8C8301AD" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-snowflake"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfprovidersnowflakego_repositorysetup_noautocloselabel_E3593A63 will be created
  + resource "github_issue_label" "repos_cdktfprovidersnowflakego_repositorysetup_noautocloselabel_E3593A63" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-snowflake-go"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderspotinst_repositorysetup_noautocloselabel_5A7F5959 will be created
  + resource "github_issue_label" "repos_cdktfproviderspotinst_repositorysetup_noautocloselabel_5A7F5959" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-spotinst"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderspotinstgo_repositorysetup_noautocloselabel_C96D5042 will be created
  + resource "github_issue_label" "repos_cdktfproviderspotinstgo_repositorysetup_noautocloselabel_C96D5042" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-spotinst-go"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfprovidertemplate_repositorysetup_noautocloselabel_2183026C will be created
  + resource "github_issue_label" "repos_cdktfprovidertemplate_repositorysetup_noautocloselabel_2183026C" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-template"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfprovidertemplatego_repositorysetup_noautocloselabel_BEAA71FA will be created
  + resource "github_issue_label" "repos_cdktfprovidertemplatego_repositorysetup_noautocloselabel_BEAA71FA" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-template-go"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfprovidertfe_repositorysetup_noautocloselabel_04FF1412 will be created
  + resource "github_issue_label" "repos_cdktfprovidertfe_repositorysetup_noautocloselabel_04FF1412" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-tfe"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfprovidertfego_repositorysetup_noautocloselabel_1176D57F will be created
  + resource "github_issue_label" "repos_cdktfprovidertfego_repositorysetup_noautocloselabel_1176D57F" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-tfe-go"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfprovidertime_repositorysetup_noautocloselabel_9AD75CAE will be created
  + resource "github_issue_label" "repos_cdktfprovidertime_repositorysetup_noautocloselabel_9AD75CAE" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-time"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfprovidertimego_repositorysetup_noautocloselabel_63CF83A1 will be created
  + resource "github_issue_label" "repos_cdktfprovidertimego_repositorysetup_noautocloselabel_63CF83A1" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-time-go"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfprovidertls_repositorysetup_noautocloselabel_02A50A48 will be created
  + resource "github_issue_label" "repos_cdktfprovidertls_repositorysetup_noautocloselabel_02A50A48" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-tls"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfprovidertlsgo_repositorysetup_noautocloselabel_43E171BF will be created
  + resource "github_issue_label" "repos_cdktfprovidertlsgo_repositorysetup_noautocloselabel_43E171BF" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-tls-go"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderupcloud_repositorysetup_noautocloselabel_0DC11E02 will be created
  + resource "github_issue_label" "repos_cdktfproviderupcloud_repositorysetup_noautocloselabel_0DC11E02" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-upcloud"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderupcloudgo_repositorysetup_noautocloselabel_93EC1C60 will be created
  + resource "github_issue_label" "repos_cdktfproviderupcloudgo_repositorysetup_noautocloselabel_93EC1C60" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-upcloud-go"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfprovidervault_repositorysetup_noautocloselabel_310B7E79 will be created
  + resource "github_issue_label" "repos_cdktfprovidervault_repositorysetup_noautocloselabel_310B7E79" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-vault"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfprovidervaultgo_repositorysetup_noautocloselabel_2A502369 will be created
  + resource "github_issue_label" "repos_cdktfprovidervaultgo_repositorysetup_noautocloselabel_2A502369" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-vault-go"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfrepositorymanager_repositorysetup_noautocloselabel_A6F3A7FD will be created
  + resource "github_issue_label" "repos_cdktfrepositorymanager_repositorysetup_noautocloselabel_A6F3A7FD" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-repository-manager"
      + url        = (known after apply)
    }

  # github_repository.repos_cdktfproviderproject_repo_014C3CE2 will be updated in-place
  ~ resource "github_repository" "repos_cdktfproviderproject_repo_014C3CE2" {
      ~ allow_auto_merge            = true -> false
      ~ allow_merge_commit          = false -> true
      - allow_update_branch         = true -> null
        id                          = "cdktf-provider-project"
        name                        = "cdktf-provider-project"
      ~ squash_merge_commit_title   = "PR_TITLE" -> "COMMIT_OR_PR_TITLE"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 76 to add, 1 to change, 0 to destroy.


```

</details>

*Pusher: @DanielMSchmidt, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*